{
  "version": "0.1.6",
  "articles": [
    {
      "id": 1,
      "thumbnailUrl": "https://example.com/thumb2.png",
      "title": "Fundamentos do SwiftUI",
      "description": "Aprenda a criar interfaces incríveis com os blocos fundamentais do SwiftUI, incluindo Text, Image, Button, VStack e HStack.",
      "createdAt": "2025-04-05",
      "isVisible": true,
      "content": [
        {
          "id": 1,
          "type": "headline",
          "value": "Desvendando a Arte de Criar Telas Incríveis: Seus Primeiros Passos com os Fundamentos do SwiftUI"
        },
        {
          "id": 2,
          "type": "body",
          "value": "No universo do desenvolvimento de aplicativos iOS, a construção de interfaces de usuário (UI) é a espinha dorsal de qualquer experiência digital. Se você está trilhando o caminho do desenvolvimento iOS, o SwiftUI se apresenta como uma ferramenta poderosa e moderna para dar vida às suas ideias."
        },
        {
          "id": 3,
          "type": "body",
          "value": "Neste post, vamos mergulhar nos blocos de construção fundamentais do SwiftUI: os elementos básicos que você usará repetidamente para estruturar as telas do seu aplicativo. Prepare-se para conhecer o Text, a Image, o Button e as versáteis VStack e HStack."
        },
        {
          "id": 4,
          "type": "headline",
          "value": "Seu Alfabeto Visual: Text e Image"
        },
        {
          "id": 5,
          "type": "body",
          "value": "O Text é essencial para exibir informações textuais com personalização através de modificadores como .font(.largeTitle) e .foregroundColor(.gray). Já a Image adiciona ícones e imagens ao app, com modificadores como .resizable() e .aspectRatio(contentMode: .fit)."
        },
        {
          "id": 6,
          "type": "headline",
          "value": "A Interatividade ao Seu Comando: Button"
        },
        {
          "id": 7,
          "type": "body",
          "value": "O Button adiciona interatividade ao seu app. Você define uma ação e um rótulo (que pode ser Text, Image ou ambos), além de personalizar a aparência com modificadores de estilo."
        },
        {
          "id": 8,
          "type": "headline",
          "value": "Dando Ordem ao Caos: VStack e HStack"
        },
        {
          "id": 9,
          "type": "body",
          "value": "A VStack organiza elementos verticalmente, enquanto a HStack os alinha horizontalmente. Ambas oferecem controle sobre alinhamento e espaçamento, permitindo criar layouts flexíveis e organizados."
        },
        {
          "id": 10,
          "type": "body",
          "value": "O SwiftUI é declarativo, ou seja, você declara o que deseja ver e o sistema cuida da renderização e reatividade. O Canvas do Xcode permite visualizar essas mudanças em tempo real, otimizando o seu fluxo de trabalho."
        },
        {
          "id": 11,
          "type": "headline",
          "value": "Construindo o Futuro da Sua Interface"
        },
        {
          "id": 12,
          "type": "body",
          "value": "Dominar Text, Image, Button, VStack e HStack é o alicerce para criar UIs envolventes com SwiftUI. Experimente, explore modificadores e veja como seus apps ganham vida com combinações criativas de layout."
        }
      ]
    }
  ]
}
